Show / Hide Table of Contents
Class SelectionItemForResults
SelectionItemForResults
Inheritance
System.Object
OpenObject
OpenElementId
SelectionItemForResults
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.SelectionItemForResults,CI.Loading", "CI.StructModel.Loading.ISelectionItemForResults,CI.BasicTypes", typeof(SelectionItemForResults))]
public class SelectionItemForResults : OpenElementId
Properties
Improve this Doc   View Source
Coeff
Coefficient
Declaration
public double Coeff { get; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Description
Description
Declaration
public string Description { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Item
ILibraryItem
Declaration
public ReferenceElement Item { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
TypeClassEvaluation
TypeClassEvaluation
Declaration
public TypeClassEvaluation TypeClassEvaluation { get; set; }
Property Value
 Type |  Description
 TypeClassEvaluation
Improve this Doc   View Source
TypeOfLoad
TypeOfLoad
Declaration
public string TypeOfLoad { get; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source